import tkinter as tk #مكتبة الواجهات الرسومية
from gui import App #كلاس بموجود داخل Gui.py

if __name__ == "__main__": #شغّل الكود الذي بالداخل فقط إذا كان هذا الملف هو الملف الرئيسي الذي يتم تشغيله.
    root = tk.Tk() #هنا ننشئ نافذة البرنامج الرئيسية
    app = App(root) #ننشئ كائن من الكلاس App ونمرّر له نافذة البرنامج (root) ليبني عليها الواجهة.
    
    #يدخل البرنامج في حلقة الأحداث (Event Loop).
    # بدونها النافذة ستفتح وتغلق فورًا.
    # تبقى الواجهة تعمل وتستجيب للأزرار والكاميرا والرسومات.
    root.mainloop() 
